In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv')

In [22]:
df1=df[['Name','Sex','Age']][0:5]
df2=df[['Name','Sex','Age']][5:10]

In [23]:
df1

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

In [24]:
df2

                                                Name     Sex   Age
5                                   Moran, Mr. James    male   NaN
6                            McCarthy, Mr. Timothy J    male  54.0
7                     Palsson, Master. Gosta Leonard    male   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [25]:
#to merge two data frames we have two ways 
#by default the pandas merge like this row wise df1
                                               #df2 or df1|df2 >> this is the horizontal merge

In [26]:
pd.concat([df1,df2]) #by default concat merges vertical (y-axis)merge

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0
5                                   Moran, Mr. James    male   NaN
6                            McCarthy, Mr. Timothy J    male  54.0
7                     Palsson, Master. Gosta Leonard    male   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [27]:
#horizontal merge
pd.concat([df1,df2],axis=1)

,Name,Sex,Age,Name,Sex,Age
0,"Braund, Mr. Owen Harris",male,22.0,NaN,NaN,NaN
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,NaN,NaN,NaN
2,"Heikkinen, Miss. Laina",female,26.0,NaN,NaN,NaN
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,NaN,NaN,NaN
4,"Allen, Mr. William Henry",male,35.0,NaN,NaN,NaN
5,NaN,NaN,NaN,"Moran, Mr. James",male,NaN
6,NaN,NaN,NaN,"McCarthy, Mr. Timothy J",male,54.0
7,NaN,NaN,NaN,"Palsson, Master. Gosta Leonard",male,2.0
8,NaN,NaN,NaN,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,NaN,NaN,NaN,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

since the index 0 to 4 are not there in data frame 2 all the values there are null similarly in data frame 1 as well

In [29]:
#so we try to match the indexes of both data sets 
df2.reset_index(drop=True, inplace=True)

In [30]:
df2

                                                Name     Sex   Age
0                                   Moran, Mr. James    male   NaN
1                            McCarthy, Mr. Timothy J    male  54.0
2                     Palsson, Master. Gosta Leonard    male   2.0
3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
4                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [31]:
pd.concat([df1,df2],axis=1)

,Name,Sex,Age,Name,Sex,Age
0,"Braund, Mr. Owen Harris",male,22.0,"Moran, Mr. James",male,NaN
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,"McCarthy, Mr. Timothy J",male,54.0
2,"Heikkinen, Miss. Laina",female,26.0,"Palsson, Master. Gosta Leonard",male,2.0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
4,"Allen, Mr. William Henry",male,35.0,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

In [37]:
dd1=pd.DataFrame({'key1':[1,2,3,4,5,6],
                 'key2':[2,6,4,6,7,3],
                 'key3':[2,7,8,9,5,3]})
dd2=pd.DataFrame({'key1':[8,2,3,9,5,6],
                 'key4':[2,9,4,6,5,3],
                 'key5':[4,7,8,9,5,3]})

In [38]:
pd.merge(dd1,dd2,how='inner') # by default is inner merge

   key1  key2  key3  key4  key5
0     2     6     7     9     7
1     3     4     8     4     8
2     5     7     5     5     5
3     6     3     3     3     3

how inner merge works : based on the common col
a b c | df1
1 4 3
2 6 7
3 8 3
4 9 0
________________
a d e |df2
1 4 3
2 6 7
6 8 3
7 9 0
____________
so basically a is the common col in both data frames and in that col 1 and 2 are the common ele so merge happens based on these ele
 df1 inner merge df2
a b c d e
1 4 3 4 3
2 6 7 6 7

In [39]:
pd.merge(dd1,dd2 ,how='left')

   key1  key2  key3  key4  key5
0     1     2     2   NaN   NaN
1     2     6     7   9.0   7.0
2     3     4     8   4.0   8.0
3     4     6     9   NaN   NaN
4     5     7     5   5.0   5.0
5     6     3     3   3.0   3.0

how left merge works : 
a b c | df1
1 4 3
2 6 7
3 8 3
________________
a d e |df2
1 4 3
2 6 7
6 8 3
___________
so basically all the cols from df1 will come and from df2 only the values from the common ele will come
df1 left merge df2
a b c d e
1 4 3 4 3
2 6 7 6 7
3 8 3 Na Na

In [40]:
pd.merge(dd1,dd2 ,how='right')

   key1  key2  key3  key4  key5
0     8   NaN   NaN     2     4
1     2   6.0   7.0     9     7
2     3   4.0   8.0     4     8
3     9   NaN   NaN     6     9
4     5   7.0   5.0     5     5
5     6   3.0   3.0     3     3

In [42]:
dd1

   key1  key2  key3
0     1     2     2
1     2     6     7
2     3     4     8
3     4     6     9
4     5     7     5
5     6     3     3

In [43]:
dd2

   key1  key4  key5
0     8     2     4
1     2     9     7
2     3     4     8
3     9     6     9
4     5     5     5
5     6     3     3

In [41]:
pd.merge(dd1,dd2 ,how='outer')

   key1  key2  key3  key4  key5
0     1   2.0   2.0   NaN   NaN
1     2   6.0   7.0   9.0   7.0
2     3   4.0   8.0   4.0   8.0
3     4   6.0   9.0   NaN   NaN
4     5   7.0   5.0   5.0   5.0
5     6   3.0   3.0   3.0   3.0
6     8   NaN   NaN   2.0   4.0
7     9   NaN   NaN   6.0   9.0

In [44]:
pd.merge(dd1,dd2 ,how='cross')

    key1_x  key2  key3  key1_y  key4  key5
0        1     2     2       8     2     4
1        1     2     2       2     9     7
2        1     2     2       3     4     8
3        1     2     2       9     6     9
4        1     2     2       5     5     5
5        1     2     2       6     3     3
6        2     6     7       8     2     4
7        2     6     7       2     9     7
8        2     6     7       3     4     8
9        2     6     7       9     6     9
10       2     6     7       5     5     5
11       2     6     7       6     3     3
12       3     4     8       8     2     4
13       3     4     8       2     9     7
14       3     4     8       3     4     8
15       3     4     8       9     6     9
16       3     4     8       5     5     5
17       3     4     8       6     3     3
18       4     6     9       8     2     4
19       4     6     9       2     9     7
20       4     6     9       3     4     8
21       4     6     9       9     6     9
22       4     6     9       5     5     5
23       4     6     9       6     3     3
24       5     7     5       8     2     4
25       5     7     5       2     9     7
26       5     7     5       3     4     8
27       5     7     5       9     6     9
28       5     7     5       5     5     5
29       5     7     5       6     3     3
30       6     3     3       8     2     4
31       6     3     3       2     9     7
32       6     3     3       3     4     8
33       6     3     3       9     6     9
34       6     3     3       5     5     5
35       6     3     3       6     3     3

In [45]:
pd.merge(dd1,dd2 ,how='left',left_on='key2',right_on='key4')

   key1_x  key2  key3  key1_y  key4  key5
0       1     2     2     8.0   2.0   4.0
1       2     6     7     9.0   6.0   9.0
2       3     4     8     3.0   4.0   8.0
3       4     6     9     9.0   6.0   9.0
4       5     7     5     NaN   NaN   NaN
5       6     3     3     6.0   3.0   3.0

In [50]:
#join works based on indexes and merge works based on cols
dd1=pd.DataFrame({'key1':[1,2,3,4,5,6],
                 'key2':[2,6,4,6,7,3],
                 'key3':[2,7,8,9,5,3]},index=['a','b','c','d','e','f'])
dd2=pd.DataFrame({'key6':[8,2,3,9,5,6],
                 'key4':[2,9,4,6,5,3],
                 'key5':[4,7,8,9,5,3]},index=['a','b','h','i','j','k'])

In [51]:
dd1

   key1  key2  key3
a     1     2     2
b     2     6     7
c     3     4     8
d     4     6     9
e     5     7     5
f     6     3     3

In [52]:
dd2

   key6  key4  key5
a     8     2     4
b     2     9     7
h     3     4     8
i     9     6     9
j     5     5     5
k     6     3     3

In [53]:
dd1.join(dd2,how='inner')

   key1  key2  key3  key6  key4  key5
a     1     2     2     8     2     4
b     2     6     7     2     9     7

In [54]:
dd1.join(dd2,how='left')

   key1  key2  key3  key6  key4  key5
a     1     2     2   8.0   2.0   4.0
b     2     6     7   2.0   9.0   7.0
c     3     4     8   NaN   NaN   NaN
d     4     6     9   NaN   NaN   NaN
e     5     7     5   NaN   NaN   NaN
f     6     3     3   NaN   NaN   NaN

In [55]:
dd1.join(dd2,how='right')

   key1  key2  key3  key6  key4  key5
a   1.0   2.0   2.0     8     2     4
b   2.0   6.0   7.0     2     9     7
h   NaN   NaN   NaN     3     4     8
i   NaN   NaN   NaN     9     6     9
j   NaN   NaN   NaN     5     5     5
k   NaN   NaN   NaN     6     3     3

In [56]:
dd1.join(dd2,how='outer')

   key1  key2  key3  key6  key4  key5
a   1.0   2.0   2.0   8.0   2.0   4.0
b   2.0   6.0   7.0   2.0   9.0   7.0
c   3.0   4.0   8.0   NaN   NaN   NaN
d   4.0   6.0   9.0   NaN   NaN   NaN
e   5.0   7.0   5.0   NaN   NaN   NaN
f   6.0   3.0   3.0   NaN   NaN   NaN
h   NaN   NaN   NaN   3.0   4.0   8.0
i   NaN   NaN   NaN   9.0   6.0   9.0
j   NaN   NaN   NaN   5.0   5.0   5.0
k   NaN   NaN   NaN   6.0   3.0   3.0

In [57]:
dd1.join(dd2,how='cross')

    key1  key2  key3  key6  key4  key5
0      1     2     2     8     2     4
1      1     2     2     2     9     7
2      1     2     2     3     4     8
3      1     2     2     9     6     9
4      1     2     2     5     5     5
5      1     2     2     6     3     3
6      2     6     7     8     2     4
7      2     6     7     2     9     7
8      2     6     7     3     4     8
9      2     6     7     9     6     9
10     2     6     7     5     5     5
11     2     6     7     6     3     3
12     3     4     8     8     2     4
13     3     4     8     2     9     7
14     3     4     8     3     4     8
15     3     4     8     9     6     9
16     3     4     8     5     5     5
17     3     4     8     6     3     3
18     4     6     9     8     2     4
19     4     6     9     2     9     7
20     4     6     9     3     4     8
21     4     6     9     9     6     9
22     4     6     9     5     5     5
23     4     6     9     6     3     3
24     5     7     5     8     2     4
25     5     7     5     2     9     7
26     5     7     5     3     4     8
27     5     7     5     9     6     9
28     5     7     5     5     5     5
29     5     7     5     6     3     3
30     6     3     3     8     2     4
31     6     3     3     2     9     7
32     6     3     3     3     4     8
33     6     3     3     9     6     9
34     6     3     3     5     5     5
35     6     3     3     6     3     3

In [60]:
#apply >> to apply to a function on all values of a function
df['Fare_inr']=df['Fare'].apply(lambda x:x*90)

In [61]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,652.500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,6415.497
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,713.250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4779.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,724.500
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1170.000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2700.000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2110.500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2700.000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,697.500

In [62]:
# to get the name len from the above table
df['Name len']=df['Name'].apply(len)

In [63]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,Name len
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,652.500,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,6415.497,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,713.250,22
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4779.000,44
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,724.500,24
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1170.000,21
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2700.000,28
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2110.500,40
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2700.000,21
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,697.500,19

In [64]:
# we can also use the user defined function with apply 
def convert(x):
    return x*100
df['Fare'].apply(convert) # we just need to pass the name of the function

0       725.00
1      7128.33
2       792.50
3      5310.00
4       805.00
        ...
886    1300.00
887    3000.00
888    2345.00
889    3000.00
890     775.00
Name: Fare, Length: 891, dtype: float64

In [65]:
#Q make a new col that says whether the fare is low or medium or high
def cate(x):
    if x<10:
        return 'low fare'
    elif x>=10 and x<=20:
        return 'medium fare'
    else:
        return 'high fare'
df['fare category']=df['Fare'].apply(cate)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_inr,Name len,fare category
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,652.500,23,low fare
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,6415.497,51,high fare
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,713.250,22,low fare
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4779.000,44,high fare
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,724.500,24,low fare
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1170.000,21,medium fare
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,2700.000,28,high fare
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,2110.500,40,high fare
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,2700.000,21,high fare
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,697.500,19,low fare